app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2016-12-28 19:17:10.631267"], ["updated_at", "2016-12-28 19:17:10.631267"]]
---
	def create
		@student = Student.create(post_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2016-12-28 19:24:25.708203"], ["id", 1]]
---
	def update
		@student = Student.find(params[:id])
		@student.update(post_params(:first_name, :last_name))